[{"description":"Takes any component and injects an ink container along with event\nlisteners for handling those inks. It also injects a prop\nnamed `ink` which needs to be added to the `ComposedComponent`.\n\n```js\n@param ComposedComponent the component to compose with the ink functionality.\n@return the ComposedComponent with inks.\n```","methods":[],"props":{"onMouseUp":{"type":{"name":"func"},"required":false,"description":"An optional onMouseUp function to call along with the ink creation onMouseUp."},"onMouseDown":{"type":{"name":"func"},"required":false,"description":"An optional onMouseDown function to call along with the ink creation onMouseDown."},"onMouseLeave":{"type":{"name":"func"},"required":false,"description":"An optional onMouseLeave function to call along with the ink creation onMouseLeave."},"onFocus":{"type":{"name":"func"},"required":false,"description":"An optional onFocus function to call along with the ink creation onFocus."},"onBlur":{"type":{"name":"func"},"required":false,"description":"An optional onBlur function to call along with the ink creation onBlur."},"onTouchStart":{"type":{"name":"func"},"required":false,"description":"An optional onTouchStart function to call along with the ink creation onTouchStart."},"onTouchMove":{"type":{"name":"func"},"required":false,"description":"An optional onTouchMove function to call along with the ink creation onTouchMove."},"onTouchEnd":{"type":{"name":"func"},"required":false,"description":"An optional onTouchEnd function to call along with the ink creation onTouchEnd."},"onTouchCancel":{"type":{"name":"func"},"required":false,"description":"An optional onTouchCancel function to call along with the ink creation onTouchCancel."},"disabled":{"type":{"name":"bool"},"required":false,"description":"Boolean if the ink or the composed component is disabled."},"inkDisabled":{"type":{"name":"bool"},"required":false,"description":"Boolean if only the ink is disabled."}},"source":"src/js/Inks/injectInk.js","component":"Ink"}]